#include "Assets.h"

std::vector<std::string> entranceArt = {
    "   _______   ",
    "  /           \\  ",
    " |   ВХОД     |  ",
    " |    В       |  ",
    " |  ЛАБИРИНТ  |  ",
    "  \\___________/  ",
    "      |   |      ",
    "      |   |      "
};

std::vector<std::string> corridorArt = {
    "  *********  ",
    "  *           *  ",
    "  *   ТЁМНЫЙ  *  ",
    "  *  КОРИДОР  *  ",
    "  *     ?     *  ",
    "  *********  "
};

std::vector<std::string> hallArt = {
    "    +-------+    ","   /         \\   ",
    "  |   ЗАЛ    |   ",
    "  | ЗАГАДОК  |   ",
    "   \\_________/   "
};

std::vector<std::string> exitArt = {
    "    /////////     ",
    "   /// ВЫХОД \\\\\\   ",
    "  //// ИЗ    \\\\\\  ",
    " //// ЛАБИРИНТА \\\\\\ ",
    "   \\\\\\_______////   "
};